import React from 'react';
import Container from '../components/Container';
import Title from '../components/Title';
import Content from '../components/Content';

const ProtocolAnchor = () => (
  <Container>
    <Title>U球体育主播协议</Title>
    <Content>
      <Content.Item>第一条 概述</Content.Item>
      <Content.Item>
        1.1 U球直播平台(以下简称“本平台”)作为网络服务提供商，为了给U球平台主播及用 户提供一个健康和谐的才艺展示与娱乐欣赏平台，根据《中华人民共和国宪法》《全国人大
        常委会关于维护互联网安全的决定》以及《互联网信息服务管理办法》等相关法律法规的规 定，制定主播管理制度(以下简称“本制度”)。
      </Content.Item>
      <Content.Item>1.2 本制度所指的直播包含娱乐类直播、体育类直播、游戏类直播等U球平台上的所有视频 业务。</Content.Item>
      <Content.Item>第二条 适用范围</Content.Item>
      <Content.Item>2.1 本制度适用于使用本平台进行直播的主播，包括但不限于主播的行为、主播昵称、主播 头像，及主播发布的直播内容等。</Content.Item>
      <Content.Item>第三条 主播行为规范</Content.Item>
      <Content.Item>3.1 本平台提倡并努力营造合法、文明、健康、绿色的直播环境，拒绝违法、低俗、消极、 有碍公序良俗的直播内容。</Content.Item>
      <Content.Item>
        3.2 主播在直播上镜时，须文明着装、文明用语，服装及妆容应符合社会公序良俗，直播内 容应符合国家法律法规的相关规定，拥护党的领导，维护国家统一，遵循社会主义精神文明
        建设，展现积极、健康、文明的形象与直播内容。
      </Content.Item>
      <Content.Item>
        3.3 根据《中华人民共和国宪法》和《全国人大常委会关于维护互联网安全的决定》《互联 网信息服务管理办法》及其他相关法律法规的规定，主播应自觉遵循法律法规、遵守社会主
        义制度、不得作出任何有损国家利益、公民合法权益，违背社会主义精神文明建设要求，违 背中华民族优良文化传统与习惯以及其他违背社会公德的行为。主播不得制作、复制、发布 如下信息:
      </Content.Item>
      <Content.Item>3.3.1 反对宪法所确定的基本原则的;</Content.Item>
      <Content.Item>3.3.2 危害国家安全、泄漏国家秘密、颠覆国家政权，破坏国家统一的;</Content.Item>
      <Content.Item>3.3.3 损害国家利益与荣誉的;</Content.Item>
      <Content.Item>3.3.4 煽动民族仇恨、民族歧视、破坏民族团结的;</Content.Item>
      <Content.Item>3.3.5 煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的;</Content.Item>
      <Content.Item>3.3.6 歪曲、丑化、亵渎、否定英雄烈士事迹和精神，或针对自然灾害、历史事件等发表相 关不当言论的;</Content.Item>
      <Content.Item>3.3.7 以非法民间组织名义活动的;</Content.Item>
      <Content.Item>3.3.8 散布谣言，扰乱社会秩序，破坏社会稳定的;</Content.Item>
      <Content.Item>3.3.9 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的;</Content.Item>
      <Content.Item>3.3.10 侮辱或者诽谤他人，侵害他人合法权益的;</Content.Item>
      <Content.Item>3.3.11 展示毒品样品、表演及传播毒品吸食或注射方式、讲解毒品制作过程等一切与毒品相 关的内容;</Content.Item>
      <Content.Item>3.3.12 组织、宣传、诱导用户加入传销(或有传销嫌疑)机构的;</Content.Item>
      <Content.Item>3.3.13 与赌博或涉嫌赌博有关的任何活动;</Content.Item>
      <Content.Item>3.3.14 使用刀具、仿真刀具、枪支、仿真枪支、表演具有高度危险性的节目等;</Content.Item>
      <Content.Item>3.3.15 包含恐怖、暴力血腥、高危险性、危害表演者自身或他人身心健康内容的，包括但不 限于如下情形:</Content.Item>
      <Content.Item>i.任何暴力和/或自残行为的内容;</Content.Item>
      <Content.Item>ii.任何威胁生命健康、利用刀具等危险器械表演的危及自身或他人人身及/或财产权利的内容;</Content.Item>
      <Content.Item>iii.怂恿、诱导他人参与可能会造成人身伤害或导致死亡的危险或违法活动的内容。</Content.Item>
      <Content.Item>3.3.16 其他威胁生命健康的表演;</Content.Item>
      <Content.Item>3.3.17 侵犯他人隐私，危及公众利益，未经当事人同意，公开他人姓名、住址、电话等个人 资料;</Content.Item>
      <Content.Item>3.3.18 播放未经授权的影视作品;</Content.Item>
      <Content.Item>3.3.19 冒充媒体、记者、电视台等进行直播活动;</Content.Item>
      <Content.Item>3.3.20 发布诋毁、损害本平台形象的言论或发布与本平台相关的不实信息、恶意信息的;</Content.Item>
      <Content.Item>3.3.21 以任何形式直播表演、发布带有色情、涉黄擦边的内容，包括但不限于如下内容:</Content.Item>
      <Content.Item>i. 通过各种方式展示或隐晦展示具有性特征的身体敏感部位;</Content.Item>
      <Content.Item>ii. 传播具有性行为、性挑逗、或性侮辱内容的任何信息;</Content.Item>
      <Content.Item>iii.以低俗、暴露、带有明显性暗示的妆容和/或着装进行直播;</Content.Item>
      <Content.Item>3.3.22 宣传非本平台链接的行为;</Content.Item>
      <Content.Item>3.3.23 房间添加虚假的体育标签，导致体育比赛分类不符合真实情况的行为;</Content.Item>
      <Content.Item>3.3.24 发布虚假广告、兼职广告等任何相关信息; 3.3.25 含有法律、行政法规禁止的任何其他内容的。</Content.Item>
      <Content.Item>第四条 违规处理</Content.Item>
      <Content.Item>
        4.1 针对主播违反本制度规定的行为的，本平台有权独立判断并视情况采取预先警示、拒绝 发布、立即停止传输信息、删除内容或评论、短期禁止发布内容或评论、限制账号部分或者
        全部功能直至终止提供服务、永久关闭帐号等措施。对于因此造成的无法正常使用帐号及相 关服务、无法正常获取帐号内资产或其他权益等后果，本平台不承担任何法律责任。本平台
        有权公告处理结果，且有权根据实际情况决定是否回复相关帐号的使用。对于涉嫌违反法律 法规、涉嫌违法犯罪的行为，本平台将保存有关记录，并有权依法向有关主管部门报告、配
        合有关主管部门调查、向公安机关报案等。对已删除的内容本平台不予恢复。
      </Content.Item>
      <Content.Item>
        4.2 因主播违反本制度规定，且引起第三方投诉或诉讼索赔的，由主播自行承担全部法律责 任，本平台不承担任何法律责任。给本平台造成损失及负面影响的，主播应全额赔偿给公司
        造成的全部损失。
      </Content.Item>
      <Content.Item>
        4.3 本平台尊重并保护主播及他人的知识产权、名誉权、姓名权、隐私权等合法权益。主播 在使用本平台过程中上传的文字、图片、视频、音频、链接等不得侵犯任何第三方的知识产
        权、名誉权、姓名权、隐私权等权利。否则，本平台有权在收到权利方或相关方通知的情况 下移除该涉嫌侵权的内容。针对第三方提出的全部权利主张，本平台不承担任何法律责任，
        由主播自行承担全部法律责任。如因该侵权行为致使本平台遭受任何损失的，主播应承担全 部赔偿责任。
      </Content.Item>
      <Content.Item>第五条 知识产权</Content.Item>
      <Content.Item>
        5.1 主播在使用本平台过程中发布上传的内容(包括但不限于文字、图片、视频、音频等各 种形式的内容)均为原创或已获得合法授权(包含转授权)。主播通过本平台上传、发布内
        容的全部知识产权归属主播或原始知识产权所有人。
      </Content.Item>
      <Content.Item>
        5.2 为使作品得到更广泛的分享及推广，主播同意将通过本平台发布的任何内容授权本平台 及其关联方获得在全球范围内，免费的、非独家的、可再许可的权利，包括但不限于复制权、
        翻译权、汇编权、信息网络传播权、改编权及制作衍生品、表演和展示的权利等。上述权利 的使用范围包括但不限于在当前或其他网站、应用程序等。
      </Content.Item>
      <Content.Item>5.3 本平台有权自行或许可第三方获得主播上传于本平台的全部内容中所涉及的肖像、个人形象、姓名、商标、服务标志、品牌等的权利和许可。</Content.Item>
      <Content.Item>5.4 对于开发、运营本平台过程中所产生的所有数据和信息，本平台享有法律法规允许范围 内的全部权利。</Content.Item>
      <Content.Item>
        5.5 未经本平台书面授权许可，主播不得私自使用本平台的商标、域名、网站名称等，也不 得向他人明示或暗示有权使用、处理上述商标等。因主播违反本条规定给他人或任何第三方
        造成的任何损失，由主播自行承担全部法律责任，本平台不承担任何法律责任。因此致使本 平台损失的，主播应承担全部法律责任。
      </Content.Item>
      <Content.Item>第六条 其他</Content.Item>
      <Content.Item>
        6.1 本制度的制定、生效、解释及争议的解决均适用中华人民共和国法律。为更好的向主播 和用户提供服务并适应可能发生的国家法律法规政策的变动、修改，技术条件、产品功能等
        变化，本平台会适时对本制度进行修订，修订的内容同样构成本制度的组成部分。本制度更 新后，本平台会发布更新版本，并将更新后的内容通过官方网站或其他适当的方式发布，以
        便主播及时了解本制度的最新版本。
      </Content.Item>
      <Content.Item>6.2 如因本制度执行过程当中发生任何争议，主播应与本平台首先进行协商解决，协商不成 的，主播或本平台均有权将争议提交至北京市朝阳区人民法院诉讼解决。</Content.Item>
      <Content.Item>6.3 主播与本平台均系独立个体，任何情况下本制度都不构成对主播任何形式的明示或暗示 的担保或条件，主播与本平台之间亦不构成代理、合伙、合营的关系。</Content.Item>
      <Content.Item>6.4 本平台对本制度保留最终解释权。</Content.Item>
    </Content>
  </Container>
);

export default ProtocolAnchor;
