import React from 'react';
import Container from '../components/Container';
import Title from '../components/Title';
import Content from '../components/Content';

const ProtocolUser = () => (
  <Container>
    <Title>U球体育用户服务协议</Title>
    <Content>
      <Content.Item>本《U球体育用户服务协议》（以下简称“协议”）系由您（以下“您”与“用户”同等）与U球公司就使用“U球体育”产品所签订的相关权利义务规范。因此，在您开始使用“U球体育”产品前,请务必仔细阅读（未成年人应在监护人陪同下阅读）并充分理解本协议的所有条款，特别涉及法律相关责任条款和U球公司免责条款。</Content.Item>
      <Content.Item>除非您自愿并完全接受本协议的全部条款，否则您无权使用“U球体育”产品。若您使用“U球体育”产品，则视为您已充分理解本协议并承诺严格恪守协议条款。</Content.Item>
      <Content.Item>1、协议适用范围</Content.Item>
      <Content.Item>1.1本协议约定了U球公司与用户之间就使用“U球体育”产品过程发生的权利与义务关系。</Content.Item>
      <Content.Item>1.2 本协议中的用户指以合法方式获取和使用“U球体育”产品的自然人。</Content.Item>
      <Content.Item>1.3 “U球体育”产品指由U球公司研发并合法拥有与运营的命名为“U球体育”的应用程序和网站。</Content.Item>
      <Content.Item>2、产品使用</Content.Item>
      <Content.Item>2.1 用户可以从合法的应用商店渠道下载“U球体育”应用程序并安装到终端设备中，也可直接访问“U球体育”网站。</Content.Item>
      <Content.Item>2.2 一旦用户打开“U球体育”应用程序或访问相应网站，即视为使用“U球体育”产品。</Content.Item>
      <Content.Item>2.3 您无需注册即可使用“U球体育”产品。但一些特定功能和相应服务，必须经注册并以注册用户身份（或第三方身份）登录方可使用。</Content.Item>
      <Content.Item>2.4 U球公司用户拥有中华人民共和国境内不可转让、非独占的和非商业性使用“U球体育”产品的权利，U球公司保留在必要情况下收回账号的权利。</Content.Item>
      <Content.Item>3、注册用户</Content.Item>
      <Content.Item>
        3.1
        “U球体育”为用户提供了注册功能，用户通过所属手机号进行账号注册，并设置符合安全要求的密码，注册成功后U球体育生成相应的U球号供用户使用。用户可根据手机号（或U球号）和密码登录“U球体育”，即可使用产品。
      </Content.Item>
      <Content.Item>
        3.2
        您在“U球体育”中注册的账号仅限于您本人使用，禁止赠与、借用、出租或倒卖。如U球公司发现账号有类似异常情况，则有权在未经通知您的情况下，限制或终止向该账号提供服务，并有权回收该账号。U球公司不承担任何由此造成的包括但不限于用户消息丢失、通信中断等用户损失。
      </Content.Item>
      <Content.Item>
        3.3
        注册用户有责任维护个人账号、密码的安全性和保密性，用户对以其注册账号名义所进行的一切行为负全部责任，包括用户资料和密码的修改、言论发表以及活动发起等其它在“U球体育”产品上的所有操作行为。如果用户发现自己账号异常，应及时修改密码或联系客服进行账号紧急处理。由于用户原因发生的密码泄露事故，责任均应由用户自行承担。
      </Content.Item>
      <Content.Item>
        3.4
        用户账号在丢失或忘记密码后，可根据“U球体育”提供的重置密码功能进行密码修改。由其它原因造成注册手机号不归个人使用，可与客服联系进行密码找回，但用户在注册账号时尽可能完善个人真实资料，若资料不完善造成无法识别申诉人是否为真正账号的所属人，造成账号被冒领或者找回被拒绝，U球公司不承担相应的责任。账号及密码的保管责任归属于用户，U球公司不承诺账号丢失或密码遗忘后一定可找回。
      </Content.Item>
      <Content.Item>3.5 用户应保证注册账号时填写的个人资料信息真实可靠，任何由于非法、不准确的用户信息产生的任何责任或损失由用户承担。用户应不断更新相应的资料，以便获得更精准的服务。</Content.Item>
      <Content.Item>3.6 除用户主动注册“U球体育”账号外，U球体育提供新浪微博、微信、腾讯QQ等第三方账号注册并登录“U球体育”。该方式注册登录的任何行为同样受本协议的条款约束。</Content.Item>
      <Content.Item>4、行为要求</Content.Item>
      <Content.Item>4.1 用户在使用“U球体育”的产品时，应遵守中华人民共和国法律。用户不得利用“U球体育”产品从事违反宪法、国家相关法律法规、政策以及触犯他人合法权利的行为。</Content.Item>
      <Content.Item>4.2 用户不得使用未经U球公司书面授权或许可的任何插件、外挂或第三方工具对“U球体育”的产品的正常运行进行干扰、破坏或人为的修改等。</Content.Item>
      <Content.Item>
        4.3
        您不得利用或针对“U球体育”产品进行任何危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或入侵未经许可的服务器/帐户；未经许可，企图探查、扫描、测试“U球体育”产品系统；企图干涉、破坏“U球体育”产品系统或网站的正常运行；故意传播恶意程序或病毒以及其他破坏干扰正常网络信息服务的行为；伪造TCP/IP数据包名称或部分名称。
      </Content.Item>
      <Content.Item>4.4 未经“U球体育”许可，您不得在“U球体育”平台上开展任何发布广告、营销等破坏产品氛围的商业行为。</Content.Item>
      <Content.Item>4.5 如果U球公司发现注册用户存在以上任何违反或可能违反上述约定的行为，“U球体育”可在任何时候不经过事先通知视情节轻重对账号进行限制、封存、删除、收回等操作。</Content.Item>
      <Content.Item>5、信息保护</Content.Item>
      <Content.Item>5.1 您在注册账号或使用“U球体育”产品过程中，需要填写相关个人信息。若您填写的信息不完整或不准确，则无法使用相关产品或在使用过程中受到限制，甚至无法获得精准服务。</Content.Item>
      <Content.Item>5.2 您可查看、修改提交的个人信息，但出于确保唯一性和准确性的考虑，部分资料信息无法实时修改甚至填写后无法修改。</Content.Item>
      <Content.Item>
        5.3
        U球公司将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息，以免遭受未经授权的访问、使用或披露。但由于病毒传播、网络不法分子通过非常规手段以及其他超出U球公司所能预见和控制的不法因素而导致用户信息泄漏的，U球公司会第一时间采取法律手段降低用户损失风险，但不承担任何责任。
      </Content.Item>
      <Content.Item>5.4 U球公司不会将用户的个人信息转移或披露给任何非关联的第三方，除以下情况：</Content.Item>
      <Content.Item>（1） 相关法律法规或法院裁决、政府要求；</Content.Item>
      <Content.Item>（2） 公司合并、分立或资产转让，用户信息随着产品而转移；</Content.Item>
      <Content.Item>（3） 为您提供要求的服务所必须的（如定位等服务）。</Content.Item>
      <Content.Item>5.5 用户对个人信息有保密的义务，请勿将个人隐私信息在“U球体育”发表、上传或扩散，否则因此带来的用户信息泄露责任由用户本人承担。</Content.Item>
      <Content.Item>5.6 在以下情况下，U球公司有权使用用户的个人信息:</Content.Item>
      <Content.Item>（1）在组织相应的平台活动时，U球公司会与第三方公司共享参与的用户信息，用户可以通过不参加活动来终止信息的被共享。</Content.Item>
      <Content.Item>（2）为了给用户提供更精准的服务，U球公司有权对所有的用户数据进行分析并对用户行为数据进行商业上的应用。</Content.Item>
      <Content.Item>6、用户交流互动规则</Content.Item>
      <Content.Item>6.1 用户在注册后，可以使用账号登录“U球体育”的APP和网站并进行聊天、发言以及各类内容发表评论。</Content.Item>
      <Content.Item>
        6.2
        U球体育致力于维护整个平台交流互动朝文明、理性、高质量方向发展，共建生态体育社圈。在消息互动、发言、评论回复等操作时，希望用户能本着自律、履行社会职责并且遵守国家法律，尊重公民合法权利，尊重社会公德的原则。
      </Content.Item>
      <Content.Item>6.3 禁止发表的信息如下：</Content.Item>
      <Content.Item>（1）反对宪法确定的基本原则的内容；</Content.Item>
      <Content.Item>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一；</Content.Item>
      <Content.Item>（3）损害国家荣誉和利益的；</Content.Item>
      <Content.Item>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</Content.Item>
      <Content.Item>（5）煽动地域歧视、地域仇恨的；</Content.Item>
      <Content.Item>（6）破坏国家宗教政策，宣扬邪教和迷信的；</Content.Item>
      <Content.Item>（7）散布谣言，扰乱社会秩序、破坏社会稳定的；</Content.Item>
      <Content.Item>（8）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</Content.Item>
      <Content.Item>（9）侮辱或者诽谤他人，侵害他人合法权益的；</Content.Item>
      <Content.Item>（10）对他人进行暴力恐吓、威胁，实施人肉搜索的；</Content.Item>
      <Content.Item>（11）未获得未满18周岁未成年人法定监护人的书面同意，传播该未成年人的隐私信息的；</Content.Item>
      <Content.Item>（12）散布污言秽语，损害社会公序良俗的；</Content.Item>
      <Content.Item>（13）侵犯他人知识产权的；</Content.Item>
      <Content.Item>（14）散布商业广告，或类似的商业招揽信息；</Content.Item>
      <Content.Item>（15）使用本网站常用语言文字以外的其他语言文字评论的；</Content.Item>
      <Content.Item>（16）与所评论的信息毫无关系的；</Content.Item>
      <Content.Item>（17）所发表的信息毫无意义的，或刻意使用字符组合、图片以逃避技术审核的；</Content.Item>
      <Content.Item>（18）法律、法规和规章禁止传播的其他信息。</Content.Item>
      <Content.Item>6.4 对于违反以上规定的用户，U球公司将视情况采取警告、删除信息、禁言、甚至回收账号等措施。对涉嫌违法犯罪的跟帖评论将保存记录，并在有关执法调查时取证使用。</Content.Item>
      <Content.Item>7、服务的变更、中断和终止</Content.Item>
      <Content.Item>
        7.1
        U球公司提供的“U球体育”产品的服务是基于现有互联网技术和条件提供的，U球公司全体员工会尽其所能向用户提供优质的服务，但由于技术的发展以及不法分子的违法行为，随时可能有不可预见的包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、天灾人祸等原因导致的服务中断、数据丢失以及其他的损失和风险。请用户随时保存备份好相应的重要数据，由于以上原因造成的损失，U球公司不承担责任。
      </Content.Item>
      <Content.Item>
        7.2
        为了更好的为用户提供服务，U球体育会定期或不定期对互联网平台及相关软硬件设备进行检修、维护、更新及升级，U球体育产品的各项服务有可能被中断或者终止，对此U球公司不承担任何责任。
      </Content.Item>
      <Content.Item>8、知识产权</Content.Item>
      <Content.Item>8.1 未经相关权利人和U球体育书面同意，用户不得对“U球体育”的产品和服务涉及的相关网页、应用、软件等产品进行反编译等操作。</Content.Item>
      <Content.Item>8.2 用户在使用“U球体育”产品和服务时发表的文字、状态、视频等原创信息，所有权归属用户，U球体育对其有使用权，同时U球体育用户具有浏览权利。</Content.Item>
      <Content.Item>
        8.3
        用户应保证，在使用“U球体育”的产品和服务时上传的文字、图片和视频等的信息不侵犯任何第三方知识产权。否则，U球体育有权在不通知用户的情况下移除该侵权信息，并对此不负任何责任。前述第三方提出权利主张，用户应自行承担责任。
      </Content.Item>
      <Content.Item>8.4若您认为您的知识产权或其他合法权益被侵犯，请提供个人身份证明、原创证明以及其他能佐证知识产权归属的资料。U球体育将第一时间对该举报进行处理。</Content.Item>
      <Content.Item>9、法律免责声明</Content.Item>
      <Content.Item>
        9.1
        U球公司对于任何从U球体育产品获得的相关信息，不保证真实、准确和完整。任何单位和个人在获取相应信息后，须自行甄别真伪和谨慎预防风险，U球体育不承担任何用户因使用该信息而造成损失、损害的责任。
      </Content.Item>
      <Content.Item>10、违约责任</Content.Item>
      <Content.Item>10.1用户因违反国家法律法规或本协议的约定或用户侵害他人任何权利因而衍生或导致任何第三人向U球公司提出任何索赔或请求而给U球公司造成损失的，包括但不限于诉讼费用、律师费用、差旅费用、和解金额、罚款或生效法律文书中规定的损害赔偿金额、软件使用费等，用户应赔偿U球公司该损失，并消除影响。</Content.Item>
      <Content.Item>11、其他</Content.Item>
      <Content.Item>11.1 本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律。</Content.Item>
      <Content.Item>11.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向U球公司所在地有管辖权的人民法院提起诉讼。</Content.Item>
      <Content.Item>
        11.3
        本协议可能因国家政策、产品以及履行环境发生变化而进行修改，U球公司会将修改后的协议发布在网站上。若您对修改后的协议有异议的，请立即停止登录、使用“U球体育”产品及服务，若您登录或继续使用“U球体育”产品及服务，则视为认可修改后的协议。
      </Content.Item>
    </Content>
  </Container>
);

export default ProtocolUser;
