import React from 'react';
import Container from '../components/Container';
import Title from '../components/Title';
import Content from '../components/Content';

const ProtocolExpert = () => (
  <Container>
    <Title>专家号入驻合作协议</Title>
    <Content>
      <Content.Item>申明：</Content.Item>
      <Content.Item>本协议所称甲方是指“U球公司”，乙方是指“入驻U球直播并申请开设或使用专家号的用户”。</Content.Item>
      <Content.Item>本协议所称“平台”、“U球直播”是指由U球公司创办的“U球直播APP”或“U球直播网https://www.uqiu.com”，包括但不限于U球直播创办的U球公司官方自媒体账号。</Content.Item>
      <Content.Item>另，基于平等自愿、互利互信的原则，乙方在甲方U球直播平台提供预测方案和图文资讯，需要阅读并遵守本协议。</Content.Item>
      <Content.Item>一、合作内容</Content.Item>
      <Content.Item>1、乙方向甲方提供掘预测方案，参与甲方平台方案销售。</Content.Item>
      <Content.Item>2、甲方按约定方式向乙方支付费用。</Content.Item>
      <Content.Item>二、合作详情</Content.Item>
      <Content.Item>1、甲方为乙方提供预测方案展示平台，乙方在平台发布方案，参与方案销售。</Content.Item>
      <Content.Item>2、甲方允许乙方露出其专家昵称，专家昵称需符合平台要求，否则不予审核通过；乙方有权调整个人昵称，但不可故意抄袭仿照他人昵称，一经发现平台有权下架处理。专家号开通注册采用实名制，乙方应当如实填写和提交帐号注册与认证资料，完成信息登记，并对资料的真实性、合法性、准确性和有效性承担责任。甲方依据乙方填写和提交的帐号资料，在法律允许的范围内向其他用户展示乙方的注册信息。如乙方提供服务或内容需要取得相关法律法规规定的许可、进行备案或取得相关合法资质的，乙方应当在帐号注册与认证时进行明确说明并提交相应的许可、备案或资质证明。否则，甲方有权拒绝或终止提供本服务，并依照本协议对违规帐号进行处罚。因此给乙方或第三方造成损害的，乙方应当依法予以赔偿。</Content.Item>
      <Content.Item>乙方理解并同意：</Content.Item>
      <Content.Item>2.1 专家号由乙方独立维护、运营并独立承担全部责任。</Content.Item>
      <Content.Item>2.2 甲方自主开发并独立享有本服务技术接口的知识产权等合法权益，乙方仅在本服务范围内进行使用。</Content.Item>
      <Content.Item>2.3 因乙方的原因导致的任何纠纷、责任等，以及乙方或乙方专家号违反相关法律法规或本协议约定引发的任何后果，均由乙方独立承担责任、赔偿损失，与甲方无关。</Content.Item>
      <Content.Item>3、乙方按照甲方约稿需求提供稿件方案，内容包括但不限于分析推荐、受注赛事前瞻分析、数据分析等。本协议到期后，甲方平台仍有权继续使用乙方已发布的稿件或者撤下乙方稿件。</Content.Item>
      <Content.Item>4、乙方保证发布内容均为原创，享有完整的知识产权，并保证发布内容没有侵犯任何第三方的著作权、名誉权、肖像权、姓名权等权利以及没有违反国家法律法规或足以导致其他法律纠纷的情形，否则因此产生的全部责任由乙方承担，引起甲方责任的，甲方有权向乙方双倍追偿，并直接在结算费用中扣除。U球直播不接受依法禁止传播或者含有下列内容之一的作品：</Content.Item>
      <Content.Item>
        1）危害国家及社会安全信息，其表现可能包括但不限于反对宪法所确定的基本原则；危害 国家安全，泄露国家机密，颠覆国家政权，破坏国家统一；煽动民族仇恨、民族歧视，破坏
        民族团结；破坏国家宗教政策，宣扬邪教和封建迷信；散布谣言，扰乱社会秩序，破坏社会 稳定；宣扬赌博、暴力、凶杀、恐怖或者教唆犯罪；煽动非法集会、结社、游行、示威、聚
        众扰乱社会秩序；含有法律、行政法规和国家规定禁止的其他内容；
      </Content.Item>
      <Content.Item>
        2）不安全信息，其表现可能包括但不限于含钓鱼网站链接的相关内容；含木马或其他病毒 网站链接及相关内容；含潜在危险、窃取用户隐私等相关内容；影响用户体验或被大量用户
        举报的未经审核的外链、二维码及其他多媒体等内容；
      </Content.Item>
      <Content.Item>
        3）垃圾营销信息，其表现可能包括但不限于从事买卖粉丝及相关业务；从事刷评论、刷转 发、刷双井号话题词、刷搜索、刷投票、刷有奖活动业务；通过机器或软件等非人力手段对
        他人页面大量发送广告信息；机器抓取发送的无意义内容、重复内容；利用系统漏洞干扰U球直播旗下专家号正常秩序（如盗用其他用户帐号、强制其他用户关注等）；影响用户体验
        或被大量用户举报的、在性质上属于推销宣传推广的营销信息；
      </Content.Item>
      <Content.Item>
        4）淫秽色情信息，其表现可能包括但不限于发布淫秽、色情内容，包括但不限于招嫖、寻 找一夜情、性伴侣等内容；发布以色情为目的的情色文字、情色视频、情色图画等内容；长
        期发布与淫秽、色情内容擦边的或具有性暗示类的内容；
      </Content.Item>
      <Content.Item>5）欺诈信息，其表现可能包括但不限于发布虚假广告、虚假中奖信息等内容；</Content.Item>
      <Content.Item>6）不正当竞争信息，其表现可能包括但不限于发布篡改、增减、删除权利标识的内容；</Content.Item>
      <Content.Item>7）侵犯第三方合法权益（包括但不限于肖像权、隐私权、名誉权、商业秘密、商标权、著 作权等）的信息；</Content.Item>
      <Content.Item>8）其他违反法律法规的内容。</Content.Item>
      <Content.Item>5，为保护U球公司的合法权益，用户在发布信息内容时不得：</Content.Item>
      <Content.Item>1）伪造标题或以其他方式操控识别资料，使人误认为该内容为U球公司所发布；</Content.Item>
      <Content.Item>2）未经U球公司书面同意发布任何带有广告、商业宣传、促销、商业推广作用的内容。</Content.Item>
      <Content.Item>对于违反以上规定的用户，U球公司将视情况采取警告、删除信息、禁言、甚至回收账号等措施。对涉嫌违法犯罪的跟帖评论将保存记录，并在有关执法调查时取证使用。</Content.Item>
      <Content.Item>6、服务的变更、中断和终止</Content.Item>
      <Content.Item>
        1）U球公司提供的“U球直播”产品的服务是基于现有互联网技术和条件提供的，U球公司全体员工会尽其所能向用户提供优质的服务，但由于技术的发展以及不法分子的违法行为，随时可能有不可预见的包括但不限于不可抗力、病毒、木马、黑客攻击、系统不稳定、天灾人祸等原因导致的服务中断、数据丢失以及其他的损失和风险。请用户随时保存备份好相应的重要数据，由于以上原因造成的损失，U球公司不承担责任。
      </Content.Item>
      <Content.Item>
        2）为了更好的为用户提供服务，U球直播会定期或不定期对互联网平台及相关软硬件设备进行检修、维护、更新及升级，U球直播产品的各项服务有可能被中断或者终止，对此U球公司不承担任何责任。
      </Content.Item>
      <Content.Item>7、知识产权</Content.Item>
      <Content.Item>1） 未经相关权利人和U球直播书面同意，用户不得对“U球直播”的产品和服务涉及的相关网页、应用、软件等产品进行反编译等操作。</Content.Item>
      <Content.Item>2） 用户在使用“U球直播”产品和服务时发表的文字、状态、视频等原创信息，所有权归属用户，U球直播对其有使用权，同时U球直播用户具有浏览权利。</Content.Item>
      <Content.Item>
        3）用户应保证，在使用“U球直播”的产品和服务时上传的文字、图片和视频等的信息不侵犯任何第三方知识产权。否则，U球直播有权在不通知用户的情况下移除该侵权信息，并对此不负任何责任。前述第三方提出权利主张，用户应自行承担责任。
      </Content.Item>
      <Content.Item>4）若您认为您的知识产权或其他合法权益被侵犯，请提供个人身份证明、原创证明以及其他能佐证知识产权归属的资料。U球直播将第一时间对该举报进行处理。</Content.Item>
      <Content.Item>三、法律责任及免责</Content.Item>
      <Content.Item>1、本站呈现的所有资料均由U球直播编辑发布，版权所有，严禁窃为己作；未经授权切勿转载或建立镜像。否则本站保留追究法律责任的权利。如欲转载、建立镜像、选用或其他任何商业用途，请联系商谈。谢谢合作！</Content.Item>
      <Content.Item>2、关于专家号用户发表的图片是否存在侵权问题：</Content.Item>
      <Content.Item>1）适用网络侵权扩大责任，专家号运营主体利用U球直播平台实施侵权行为的，被侵权人有权通知平台采取删除、屏蔽、断开链接等必要措施。平台接到通知后会第一时间核实确认，并及时采取必要措施。</Content.Item>
      <Content.Item>2）乙方理解并同意，平台很难知悉乙方发表内容是否侵权，对于可能涉嫌侵权的图片、内容等，甲方有权第一时间采取必要措施进行处理，因此导致的全部损失由乙方承担。提醒：第三方机构或个人可能在U球直播宣传他们的产品或服务，U球直播将不保证其宣传信息的准确性，您跟第三方机构或个人的任何交易与U球直播无关，U球直播将不会对可能引起的任何损失负责。</Content.Item>
      <Content.Item>3、如果乙方从未经甲方授权的第三方获取U球直播APP或与U球直播APP名称相同的安装程序、网址等，甲方无法保证该软件、网址能够正常使用访问，并对因此给乙方造成的损失不予负责。</Content.Item>
      <Content.Item>4、乙方理解并同意甲方将会尽其商业上的合理努力保障平台中的数据存储安全，但是，并不能就此提供完全保证，包括但不限于以下情形：</Content.Item>
      <Content.Item>1） 甲方不对平台中相关数据的删除或储存失败负责；</Content.Item>
      <Content.Item>2） 甲方有权根据实际情况自行决定平台中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。</Content.Item>
      <Content.Item>3） 如果乙方停止使用平台或服务被终止或取消，甲方可以从服务器上永久地删除乙方的数据。服务停止、终止或取消后，乙方没有义务向甲方返还任何数据。</Content.Item>
      <Content.Item>4） 乙方理解并同意，甲方有权决定将平台作商业用途，包括但不限于开发、使用平台部分服务为第三方作推广等。</Content.Item>
      <Content.Item>
        5）乙方理解并同意，平台同大多数互联网软件一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁终端设备信息和数据安全，继而影响平台的正常使用等。因此，乙方应加强信息安全及个人信息的保护意识，注意密码保护，避免擅自出租出借给第三人，以免遭受损失，否则因此导致的全部损失由乙方自行承担。
      </Content.Item>
      <Content.Item>四、其他注意事项</Content.Item>
      <Content.Item>1、为了更好的向用户及作者提供服务，本平台将不定期对本协议进行修订，修订后的协议将通过公示的方式实现对专家作者的告知。若专家作者不接受修改的内容，可停止使用本平台的专家号服务。如果继续使用，则视为已接受修改后的协议。</Content.Item>
      <Content.Item>2、本协议之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国大陆地区法律;如法律无相关规定的，参照商业惯例或行业惯例。</Content.Item>
      <Content.Item>3、若作者和本平台之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，可将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。</Content.Item>
      <Content.Item>4、本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。</Content.Item>
      <Content.Item>5、本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</Content.Item>
      <Content.Item>6、本协议的版权归本平台所有，本平台保留一切解释和修改权利。</Content.Item>
    </Content>
  </Container>
);

export default ProtocolExpert;
